Have the ability to become invisible or super strength
Have a permanent smile or a permanent frown stuck on your face
Wear makeup every day for a year or spend a whole year without being able to wash your face
Stand on stage in front of everyone you know in your underwear, or dress like a clown for a week
Be a butterfly or a bee
Go a month without sleep, or a year without any kind of sugar
Wake up really early, or stay up really late
Wake up really early, or stay up really late
Be a shark or a caterpillar
Have a pet snake, or a pet turtle
Become an incredible baker, or an incredible cook
Be a vampire or a werewolf
Have your favourite food every day, or have a million dollars – but never have your favourite food again
Live in a house with broken heating, or broken air conditioning
Become a cartoon character, or see everyone you know become cartoon characters
Having to give up your favourite food, or having to give up your favourite dessert
Never see winter again, or never see summer again
Be a garbage collector or a person who sorts recycling
Never being able to watch television again, or never being able to read a book again
Be a wizard or a superhero
Have pancakes or waffles
Have a sweet snack or a salty snack
Be a tree or a flower
Spend a day in the body of someone of the opposite sex, or spend a day in one of your parent’s bodies
Have twenty siblings or no siblings
Spend a year without video games, or a year without a cell phone
Spend a whole day reading the dictionary or a whole year studying a new language
Wake up to the smell of autumn everyday, or wake to the smell of spring everyday
Never see the sun again or never see the moon again
Dog or Cat?
Cookies or cake?
Cuddling or sleeping?
Car or truck?
Netflix or YouTube?
Pop music or Rock music?
Calls or texts?
Bus or train?
Toast or Eggs?
Stuff animals or dolls?
Shower or tub?
Cardio or Weights?
Pancakes or waffles?
Summer or Winter?
Country or city?
Facebook or Twitter?
Ice Cream Cone or Snow Cone?
Hot chocolate or coffee?
Ocean or mountains?
Mobile Games or Console Games?
Morning or evening?
Day or night?
Library or museums?
French or Spanish?
Summer or winter?
Theater or cinema?
Love or money?
iOS or Android?
Form or Function?
Pop or Indie?
Cake or Pie?
Swimming or Sunbathing?
High-tech or Low-tech?
Book or movie?
Tea or coffee?
Chocolate or vanilla?
Coca-Cola or Pepsi?
Rain or snow?
Car or motorcycle?
Comedy or horror?
Hamburgers or hot dogs?
Paper or plastic?
Boat or plane?
Painting or drawing?
Reading or writing?
Singing or dancing?
New Clothes or New Phone?
Rich Friend or Loyal Friend?
Football or Basketball?
Work Hard or Play Hard?
Jogging or Hiking?
Be worshipped or hated
Be nauseous all day, or have a headache all day
Have only twenty hours in a day, or only five days in a week
Forget everything you’ve ever learned, or forget everyone you’ve ever known
Face your biggest fear, or spend a week with the person you dislike the most
Do schoolwork for so long you feel sick or feel so stick you can’t do schoolwork
Get lost alone, or get lost with someone who annoys you
Lose all thought, or lose all feeling
Be raised by wolves, or be raised by sharks
Be covered by bug bites, or be covered in chicken pox
Do what is right, even if it isn’t popular, or do what is wrong and be liked
Be homeless, or be hungry
Be physically attractive, or be intelligent
Find out someone you trust has lied to you, or lie someone who trusts you
Never be able to cry again, or never be able to laugh again
Have a fight with your best friend, or have a fight with one of your parents
Be attacked by a bear, or be attacked by a snake
Find out you’re actually a robot, or find out you’ve been living your whole life in a dream
Watch a black and white movie or visit a historic site
Knit a sweater or crochet an afghan
Be interviewed on television or have your interview published in a newspaper
Sit on a couch or sit on a recliner
Swim in the ocean or swim in a pool
Collect seashells by the seashore or collect Pokemon cards
Play music or make music
Play outside or create a blanket fort
Learn to play the clarinet or the tuba
Go hunting or fishing
Try a food you’ve never tasted or read a book from a new author
Go on a safari or on a cruise
Meet someone famous from the past or someone famous in the present
Speak a foreign language or create your own language
Run a mile or walk to the mailbox
Be multilingual or always have a translator with you
Sleep in a tent or sleep under the stars
Run through the woods or stroll through a field
this or that pics
‍

Influencers or celebrities?
Call or text?
Ocean or lake?
Sparkle or matte?
Jog or hike?
Pen or pencil?
Save or spend?
Cards or crossword puzzles?
Teamwork or solo project?
Mac or PC?
Sneakers or sandals?
Hat or headband?
Tattoos or piercings?
Jeans or sweats?
Roses or tulips?
Bar soap or shower gel?
Convertible or coupe?
Car or truck?
Left side or right side of bed?
Past or future?
Math class or English class?
Book smarts or street smarts?
Snap or TikTok?
Pedicure or manicure?
Chess or checkers?
Skiing or snowboarding?
Yoga or CrossFit?
Golf or bowling?
Jog or hike?
Radio or television?
This or that ideas



Learn to sing opera or learn to play jazz
Make a doll or play with a doll
Create a painting or sketch something
Use watercolors or oil paints
Go to school or teach yourself
Learn how to dance or learn how to sew
Make a snow angel or build an igloo
Sit by the window and watch birds or take a hike through the woods
Take a nap or go to bed early
Get up early or stay up late
Visit a cemetery or go to a quiet place to mourn
Climb a tree or sit under a tree
Go on a hayride or on a rollercoaster
Meet the Prime Minister of Canada or the President of the United States
Talk on the phone or talk to someone in person
Sleep with the window open or closed
Try to learn German or be already able to speak Spanish
Be invisible or fly like superman
Relax on the couch or stay in bed all day

Receive a box of candy or roses for Valentine's Day?
Receive a piece of jewelry or a room makeover for an anniversary?
Receive a greeting card or a balloon for a birthday wish?
Receive a surprise romantic dinner or a surprise shopping spree?
Receive a kiss on the cheek or a hug?
Receive a love note on your car windshield at work or a sexy text message?
Receive a single rose on your pillow or an expensive piece of chocolate?
Receive a love note in your lunch bag or sweet candy treat?
Receive a gift card from your favorite store or a wrapped gift, contents unknown?
Receive wink during a business meeting or play footsie at dinner?
Be best friends/lovers or just lovers?
Spend a holiday alone together or with family?
Have separate hobbies or one together?
Go to your high school reunion alone or together?
Sing your favorite song together or listen to a recording?
Tell your lover a white lie to spare feelings or blurt out the truth?
Forgive your lover or harbor a grudge?
Try something new with your lover or stay with the tried and true?
Spend the evening at home cuddling on the couch or painting the town red?
Take a spontaneous trip together or plan every detail?
Write your own wedding vows or copy from a website?
Serenade your lover or hire musicians?
Surprise your lover with rose petals strewn from the door to the bedroom or greet them at the door with Champagne?
Find your lover waiting in a bubble bath or all packed for a surprise weekend getaway?
Come home to dinner on the table or ushered out to your favorite restaurant?
Spend the day together being pampered at a spa or enjoying a workout at the gym?
Spend the evening together playing a video game or cuddled together reading a book?
Go to a jazz club or a rock concert?
Dance to slow music or go wild with retro disco music?
Read poetry together or go sailing on the lake?
Be rich or famous?
Be able to fly or read minds?
Travel back in time, or travel to the future?
Explore the deep sea or outer space?
Be an artist or an athlete?
Be a good singer or a good dancer?
Give up social media or be an influencer?
Be bored or busy?
Be feared or loved?
Have more time or more money?
Know how you die or when you die?
Be able to see into the future or not?
Be really funny or really smart?
Die in 10 years with no regrets or live for 30 years with lots of regrets?
Die before or after your partner?
Be your own boss or work for someone else?
Go to jail for a crime you didn’t commit, or get away with a crime but be paranoid about being caught for your entire life?
Have 10 children or no children?
Live in a big city or a small town?
Have a public or private proposal?
Have a huge wedding or just get a marriage license?
This or that questions for Adults
Eat only ice cream for the rest of your life, or never eat ice cream again?
Have a personal chef or a chauffeur?
Be too hot or too cold?
Spend time at the beach or the ocean?
Live without movies or live without music?
Read a book or watch a movie?
Be able to teleport or have a private plane?
Look 10 years older from the neck up or down?
Always be underdressed or always be overdressed?
Be 45 minutes late or 45 minutes early to every event or engagement?
Know every language, but never be able to travel to another country, or would you
Be remembered in history books for doing something terrible, or be completely forgotten after you die?
Not brush your teeth for a week or not take a shower for two weeks?
Be beautiful and dumb or smart and unattractive?
Be able to speak any language or be able to speak to animals?
Have your least favorite song played on a constant loop, or never listen to music ever again?
Have a photographic memory or perfect pitch?
Lose all of the money you earned this year or lose all of the memories you made this year?
Get stranded by yourself on a desert island, or stranded on a snow mountain?
Be on a dating show or a survival show?
Always have a runny rose or always have a cough?
Be a horse or a dog?
Be serenaded by Snoop Dog or Mariah Carey?